package org.example.lessons.lesson04.homework

val int: Int = 42
val long: Long = 98765432123456789L
val float: Float = 23.45f
val double: Double = 0.123456789
val string: String = "Kotlin & Java"
val boolean: Boolean = false // val boolean: Boolen = FALSE
val char: Char = 'c'
val short: Short = 500
val long2: Long = 4294967296L
val float2: Float = 18.0f
val double2: Double = -0.001
val string2: String = "OpenAI"
val string3: String = "true" // val boolean: Boolean = "true"
val array: Array<Int> = arrayOf(3, 14) // val v14 = listOf(3, 14)
val character: Char = '9'
val integer: Int = 2048
val long3: Long = 10000000000L
// error val list: List<Sting> = listOf("OpenAI", "Quantum Computing") // val v18 = setOf("OpenAI", "Quantum Computing")
val float3: Float = 5.75f
// error val v20 = `1.414`
val v21 = "Artificial Intelligence"
val v22 = arrayOf('x', "A")
val v23 = "Android Studio"
val v24 = '@'
val v25 = 1024
val v26 = 1234567890123L
val v27 = 10.01f
val v28 = -273.15
val v29 = "SpaceX"
// error val v30 = FALSE
val v31 = 0.007
// error val v32 = “🤯”
val v33 = mapOf("true" to 2, "false" to 34)
// error val v34 = ‘65535’
val v35 = 72057594037927935L
val v36 = 2.71828f
val v37 = 101.0101
val v38 = "Quantum Computing"
val v39 = mapOf(2 to "true", 34 to "false")
val v40 = 'x'
val v41 = 314
val v42 = 123456789123456789L
val v43 = 6.626f
// error val v44 = TRUE

//Хранить букву, на которую указывает палец медиума во время спиритического сеанса.
//Хранить количество ложек сахара, которые я кладу в одну чашку чая.
//Хранить список расходов на доставку еды, чтобы ещё раз убедиться, что готовить было дешевле.
//Хранить длину очереди в столовой до миллиардной доли сантиметра.
//Хранить факт, закрыт ли баг после того, как его просто переименовали в фичу.
//Хранить количество свистков чайника за день.
//Хранить количество нажатий котом на клавиатуру ноутбука за всё время твоей работы.
//Хранить количество попыток пересчитать звёзды на небе за всю историю человечества.
//Хранить массу воздуха в спускающем матрасе после нападения кота в долях грамма.
//Хранить словарь «название стартапа → сумму потерь инвесторов».
//Хранить строку «починилось само», чтобы закрывать тикеты без лишних слов.
//Хранить список тем для митингов, которые на самом деле никому не нужны.